tutorials/legacy/electromagnetics/mhdFoam/hartmann/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;

setFormat       raw;

sets
(
    line_centreProfile
    {
        type    lineUniform;
        axis    distance;
        start   (10.001 -1 0.01);
        end     (10.001 1 0.01);
        nPoints 100;
    }
);

fields          ( Ux );


// ************************************************************************* //
